LucasJezap/EmbeddedSystems/flac-player-stm32disco/Src/stm32f476g-disco-controller.c
#include "stm32f476g-disco-controller.h"

#include "stm32f476g-disco-files.h"
#include "log.h"
#include "stm32f476g-disco-player.h"
#include "stm32f476g-disco-screen.h"
#include "Inc/usb_host.h"
#include "Middlewares/Third_Party/FreeRTOS/Source/CMSIS_RTOS/cmsis_os.h"

extern ApplicationTypeDef Appli_state;

static Files files;
static int current_file_index = 0;

static void WaitForUsbStorage(void) {
    xprintf("Waiting for USB mass storage...\n");
    while (Appli_state != APPLICATION_READY) {
        xprintf(".");
        osDelay(250);
    }
    xprintf("USB mass storage ready\n");
}

static const char *GetCurrentFilePath(void) {
    static char path[3 + MAX_FILE_PATH_LENGTH + 1];
    snprintf(path, sizeof(path), "0:/%s", files.files[current_file_index]);
    return path;
}

static void PlayOrPause(void) {
    switch (Player_GetState()) {
        case PlayerState_Stopped:
            Player_Play(GetCurrentFilePath());
            break;

        case PlayerState_Playing:
            Player_Pause();
            break;

        case PlayerState_Paused:
            Player_Resume();
            break;
    }
}

static void SkipPrevious(void) {
    if (Player_GetState() != PlayerState_Stopped) {
        Player_Stop();
    }

    current_file_index = (current_file_index - 1 + files.count) % files.count;
    Player_Play(GetCurrentFilePath());
}

static void SkipNext(void) {
    if (Player_GetState() != PlayerState_Stopped) {
        Player_Stop();
    }

    current_file_index = (current_file_index + 1) % files.count;
    Player_Play(GetCurrentFilePath());
}

void Controller_Task(void) {
    Screen_Initialize();
    Screen_Initialize(); // Workaround for broken display
    Screen_Initialize();

    Screen_RenderInfo("Waiting for USB drive...LOL");
    osDelay(500);

    WaitForUsbStorage();

    Screen_RenderInfo("Searching FLAC files...");
    osDelay(500);

    FindFlacFiles("0:", &files);

    Screen_RenderInfo("Initializing player...");
    osDelay(500);

    Player_Init();

    for (;;) {
        Screen_HandleTouch();
        Screen_RenderPlayer(
            /*number_of_files*/ files.count,
            /*current_file_index*/ current_file_index,
            /*current_file_name*/ files.files[current_file_index],
            /*progress*/ Player_GetProgress(),
            /*is_playing*/ Player_GetState() == PlayerState_Playing
        );

        if (Screen_IsPlayPauseButtonTouched()) {
            PlayOrPause();
        } else if (Screen_IsBackButtonTouched()) {
            SkipPrevious();
        } else if (Screen_IsNextButtonTouched()) {
            SkipNext();
        }

        Player_Update();
    }
}
